// Вывести на экран число "Пи" с точностью до сотых

double pi = Math.PI;
Console.WriteLine("{0:0.00}", pi);

//Вывести на экран число "е" с точностью до десятых

double e = Math.E;
Console.Write("{0:0.0}", e);